root-2.3.0/run/tutorials/lagrangian/reactingParcelFoam/filter/0.org/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 0 -3 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 1;
        value           uniform 0;
        refValue        uniform 0;
        refGradient     uniform 0;
        valueFraction   uniform 0;
    }
    inlet
    {
        type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 1;
        value           uniform 0;
        refValue        uniform 0;
        refGradient     uniform 0;
        valueFraction   uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    cycLeft_half0
    {
        type            cyclic;
    }
    cycRight_half0
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
    cycLeft_half1
    {
        type            cyclic;
    }
    cycRight_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
